InDeviceMex/TM4C123/TM4C123_GPIO_LCD1602/xDriver_MCU/Driver_Header/EEPROM/EEPROM_Register.h
/*
 * EEPROM_Register.h
 *
 *  Created on: 16 jun. 2020
 *      Author: vyldram
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_REGISTER_H_
#define XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_REGISTER_H_

#include <xDriver_MCU/Driver_Header/EEPROM/EEPROM_Struct.h>


#define EEPROM_BASE            (0x400AF000)
#define EEPROM_BITBANDING_BASE (0x42000000)
#define EEPROM_OFFSET          (0x000AF000)


#define EEPROM                 (((EEPROM_TypeDef*)(EEPPROM_BASE)))
#define EEPROM_BITBANDING      (((EEPROM_BITBANDING_TypeDef*)(EEPROM_BITBANDING_BASE+(EEPROM_OFFSET*32))))


#define EEPROM_EESIZE_OFFSET     (0x0000)
#define EEPROM_EEBLOCK_OFFSET    (0x0004)
#define EEPROM_EEOFFSET_OFFSET   (0x0008)
#define EEPROM_EERDWR_OFFSET     (0x0010)
#define EEPROM_EERDWRINC_OFFSET  (0x0014)
#define EEPROM_EEDONE_OFFSET     (0x0018)
#define EEPROM_EESUPP_OFFSET     (0x001C)
#define EEPROM_EEUNLOCK_OFFSET   (0x0020)
#define EEPROM_EEPROT_OFFSET     (0x0030)
#define EEPROM_EEPASS0_OFFSET    (0x0034)
#define EEPROM_EEPASS1_OFFSET    (0x0038)
#define EEPROM_EEPASS2_OFFSET    (0x003C)
#define EEPROM_EEINT_OFFSET      (0x0040)
#define EEPROM_EEHIDE_OFFSET     (0x0050)
#define EEPROM_EEDBGME_OFFSET    (0x0080)
#define EEPROM_EEPROMPP_OFFSET   (0x0FC0)

/******************************************************************************************
************************************ 1 EESIZE *********************************************
******************************************************************************************/
#define EEPROM_EESIZE            (((EESIZE_TypeDef*)(EEPROM_BASE+EEPROM_EESIZE_OFFSET )))
#define EEPROM_EESIZE_R          (*((volatile const uint32_t *)(EEPROM_BASE+EEPROM_EESIZE_OFFSET)))
#define EEPROM_BITBANDING_EESIZE (((BITBANDING_EESIZE_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EESIZE_OFFSET)*32))))

//--------
#define EEPROM_EESIZE_R_WORDCNT_MASK     (0x0000FFFF)
#define EEPROM_EESIZE_R_WORDCNT_BIT      (0)
#define EEPROM_EESIZE_R_WORDCNT_NUMBER   (0x00000200)

#define EEPROM_EESIZE_WORDCNT_MASK       (0x0000FFFF)
#define EEPROM_EESIZE_WORDCNT_NUMBER     (0x00000200)
//--------

//--------
#define EEPROM_EESIZE_R_BLKCNT_MASK     (0x07FF0000)
#define EEPROM_EESIZE_R_BLKCNT_BIT      (16)
#define EEPROM_EESIZE_R_BLKCNT_NUMBER   (0x00200000)

#define EEPROM_EESIZE_BLKCNT_MASK       (0x000007FF)
#define EEPROM_EESIZE_BLKCNT_NUMBER     (0x00000020)
//--------

/******************************************************************************************
************************************ 2 EEBLOCK *********************************************
******************************************************************************************/
#define EEPROM_EEBLOCK            (((EEBLOCK_TypeDef*)(EEPROM_BASE+EEPROM_EEBLOCK_OFFSET )))
#define EEPROM_EEBLOCK_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEBLOCK_OFFSET)))
#define EEPROM_BITBANDING_EEBLOCK      (((BITBANDING_EEBLOCK_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEBLOCK_OFFSET)*32))))

//--------
#define EEPROM_EEBLOCK_R_BLOCK_MASK     (0x0000FFFF)
#define EEPROM_EEBLOCK_R_BLOCK_BIT      (0)

#define EEPROM_EEBLOCK_BLOCK_MASK       (0x0000FFFF)
//--------

/******************************************************************************************
************************************ 3 EEOFFSET *********************************************
******************************************************************************************/
#define EEPROM_EEOFFSET            (((EEOFFSET_TypeDef*)(EEPROM_BASE+EEPROM_EEOFFSET_OFFSET )))
#define EEPROM_EEOFFSET_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEOFFSET_OFFSET)))
#define EEPROM_BITBANDING_EEOFFSET      (((BITBANDING_EEOFFSET_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEOFFSET_OFFSET)*32))))

//--------
#define EEPROM_EEOFFSET_R_OFFSET_MASK     (0x0000000F)
#define EEPROM_EEOFFSET_R_OFFSET_BIT      (0)

#define EEPROM_EEOFFSET_OFFSET_MASK       (0x0000000F)
//--------

/******************************************************************************************
************************************ 4 EERDWR *********************************************
******************************************************************************************/
#define EEPROM_EERDWR            (((EERDWR_TypeDef*)(EEPROM_BASE+EEPROM_EERDWR_OFFSET )))
#define EEPROM_EERDWR_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EERDWR_OFFSET)))
#define EEPROM_BITBANDING_EERDWR      (((BITBANDING_EERDWR_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EERDWR_OFFSET)*32))))

//--------
#define EEPROM_EERDWR_R_VALUE_MASK     (0xFFFFFFFF)
#define EEPROM_EERDWR_R_VALUE_BIT      (0)

#define EEPROM_EERDWR_VALUE_MASK       (0xFFFFFFFF)
//--------

/******************************************************************************************
************************************ 5 EERDWRINC *********************************************
******************************************************************************************/
#define EEPROM_EERDWRINC            (((EERDWRINC_TypeDef*)(EEPROM_BASE+EEPROM_EERDWRINC_OFFSET )))
#define EEPROM_EERDWRINC_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EERDWRINC_OFFSET)))
#define EEPROM_BITBANDING_EERDWRINC      (((BITBANDING_EERDWRINC_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EERDWRINC_OFFSET)*32))))

//--------
#define EEPROM_EERDWRINC_R_VALUE_MASK     (0xFFFFFFFF)
#define EEPROM_EERDWRINC_R_VALUE_BIT      (0)

#define EEPROM_EERDWRINC_VALUE_MASK       (0xFFFFFFFF)
//--------

/******************************************************************************************
************************************ 6 EEDONE *********************************************
******************************************************************************************/
#define EEPROM_EEDONE            (((EEDONE_TypeDef*)(EEPROM_BASE+EEPROM_EEDONE_OFFSET )))
#define EEPROM_EEDONE_R          (*((volatile const uint32_t *)(EEPROM_BASE+EEPROM_EEDONE_OFFSET)))
#define EEPROM_BITBANDING_EEDONE      (((BITBANDING_EEDONE_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEDONE_OFFSET)*32))))

//--------
#define EEPROM_EEDONE_R_WORKING_MASK     (0x00000001)
#define EEPROM_EEDONE_R_WORKING_BIT      (0)
#define EEPROM_EEDONE_R_WORKING_DIS      (0x00000000)
#define EEPROM_EEDONE_R_WORKING_EN       (0x00000001)

#define EEPROM_EEDONE_WORKING_MASK       (0x00000001)
#define EEPROM_EEDONE_WORKING_DIS        (0x00000000)
#define EEPROM_EEDONE_WORKING_EN         (0x00000001)
//--------

//--------
#define EEPROM_EEDONE_R_WKERASE_MASK     (0x00000004)
#define EEPROM_EEDONE_R_WKERASE_BIT      (2)
#define EEPROM_EEDONE_R_WKERASE_DIS      (0x00000000)
#define EEPROM_EEDONE_R_WKERASE_EN       (0x00000004)

#define EEPROM_EEDONE_WKERASE_MASK       (0x00000001)
#define EEPROM_EEDONE_WKERASE_DIS        (0x00000000)
#define EEPROM_EEDONE_WKERASE_EN         (0x00000001)
//--------

//--------
#define EEPROM_EEDONE_R_WKCOPY_MASK     (0x00000008)
#define EEPROM_EEDONE_R_WKCOPY_BIT      (3)
#define EEPROM_EEDONE_R_WKCOPY_DIS      (0x00000000)
#define EEPROM_EEDONE_R_WKCOPY_EN       (0x00000008)

#define EEPROM_EEDONE_WKCOPY_MASK       (0x00000001)
#define EEPROM_EEDONE_WKCOPY_DIS        (0x00000000)
#define EEPROM_EEDONE_WKCOPY_EN         (0x00000001)
//--------

//--------
#define EEPROM_EEDONE_R_NOPERM_MASK     (0x00000010)
#define EEPROM_EEDONE_R_NOPERM_BIT      (4)
#define EEPROM_EEDONE_R_NOPERM_NOERROR  (0x00000000)
#define EEPROM_EEDONE_R_NOPERM_ERROR    (0x00000010)

#define EEPROM_EEDONE_NOPERM_MASK       (0x00000001)
#define EEPROM_EEDONE_NOPERM_NOERROR    (0x00000000)
#define EEPROM_EEDONE_NOPERM_ERROR      (0x00000001)
//--------

//--------
#define EEPROM_EEDONE_R_WRBUSY_MASK     (0x00000020)
#define EEPROM_EEDONE_R_WRBUSY_BIT      (5)
#define EEPROM_EEDONE_R_WRBUSY_NOERROR  (0x00000000)
#define EEPROM_EEDONE_R_WRBUSY_ERROR    (0x00000020)

#define EEPROM_EEDONE_WRBUSY_MASK       (0x00000001)
#define EEPROM_EEDONE_WRBUSY_NOERROR    (0x00000000)
#define EEPROM_EEDONE_WRBUSY_ERROR      (0x00000001)
//--------

#define EEPROM_BITBANDING_EEDONE_WORKING     (*((volatile const uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEDONE_OFFSET)*32)+(EEPROM_EEDONE_R_WORKING_BIT*4))))
#define EEPROM_BITBANDING_EEDONE_WKERASE     (*((volatile const uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEDONE_OFFSET)*32)+(EEPROM_EEDONE_R_WKERASE_BIT*4))))
#define EEPROM_BITBANDING_EEDONE_WKCOPY      (*((volatile const uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEDONE_OFFSET)*32)+(EEPROM_EEDONE_R_WKCOPY_BIT*4))))
#define EEPROM_BITBANDING_EEDONE_NOPERM      (*((volatile const uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEDONE_OFFSET)*32)+(EEPROM_EEDONE_R_NOPERM_BIT*4))))
#define EEPROM_BITBANDING_EEDONE_WRBUSY      (*((volatile const uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEDONE_OFFSET)*32)+(EEPROM_EEDONE_R_WRBUSY_BIT*4))))

/******************************************************************************************
************************************7 EESUPP *********************************************
******************************************************************************************/
#define EEPROM_EESUPP            (((EESUPP_TypeDef*)(EEPROM_BASE+EEPROM_EESUPP_OFFSET )))
#define EEPROM_EESUPP_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EESUPP_OFFSET)))
#define EEPROM_BITBANDING_EESUPP      (((BITBANDING_EESUPP_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EESUPP_OFFSET)*32))))

//--------
#define EEPROM_EESUPP_R_START_MASK     (0x00000001)
#define EEPROM_EESUPP_R_START_BIT      (0)
#define EEPROM_EESUPP_R_START_DIS      (0x00000000)
#define EEPROM_EESUPP_R_START_EN       (0x00000001)

#define EEPROM_EESUPP_START_MASK       (0x00000001)
#define EEPROM_EESUPP_START_DIS        (0x00000000)
#define EEPROM_EESUPP_START_EN         (0x00000001)
//--------

//--------
#define EEPROM_EESUPP_R_EREQ_MASK     (0x00000002)
#define EEPROM_EESUPP_R_EREQ_BIT      (1)
#define EEPROM_EESUPP_R_EREQ_DIS      (0x00000000)
#define EEPROM_EESUPP_R_EREQ_EN       (0x00000002)

