InDeviceMex/TM4C123/TM4C123_GPIO_LCD1602/xDriver_MCU/Driver_Header/EEPROM/EEPROM_Register.h
#define EEPROM_EESUPP_EREQ_MASK       (0x00000001)
#define EEPROM_EESUPP_EREQ_DIS        (0x00000000)
#define EEPROM_EESUPP_EREQ_EN         (0x00000001)
//--------

//--------
#define EEPROM_EESUPP_R_ERETRY_MASK     (0x00000004)
#define EEPROM_EESUPP_R_ERETRY_BIT      (2)
#define EEPROM_EESUPP_R_ERETRY_DIS      (0x00000000)
#define EEPROM_EESUPP_R_ERETRY_EN       (0x00000004)

#define EEPROM_EESUPP_ERETRY_MASK       (0x00000001)
#define EEPROM_EESUPP_ERETRY_DIS        (0x00000000)
#define EEPROM_EESUPP_ERETRY_EN         (0x00000001)
//--------

//--------
#define EEPROM_EESUPP_R_PRETRY_MASK     (0x00000008)
#define EEPROM_EESUPP_R_PRETRY_BIT      (3)
#define EEPROM_EESUPP_R_PRETRY_NOERROR  (0x00000000)
#define EEPROM_EESUPP_R_PRETRY_ERROR    (0x00000008)

#define EEPROM_EESUPP_PRETRY_MASK       (0x00000001)
#define EEPROM_EESUPP_PRETRY_NOERROR    (0x00000000)
#define EEPROM_EESUPP_PRETRY_ERROR      (0x00000001)
//--------

#define EEPROM_BITBANDING_EESUPP_START       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EESUPP_OFFSET)*32)+(EEPROM_EESUPP_R_START_BIT*4))))
#define EEPROM_BITBANDING_EESUPP_EREQ        (*((volatile const uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EESUPP_OFFSET)*32)+(EEPROM_EESUPP_R_EREQ_BIT*4))))
#define EEPROM_BITBANDING_EESUPP_ERETRY      (*((volatile const uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EESUPP_OFFSET)*32)+(EEPROM_EESUPP_R_ERETRY_BIT*4))))
#define EEPROM_BITBANDING_EESUPP_PRETRY      (*((volatile const uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EESUPP_OFFSET)*32)+(EEPROM_EESUPP_R_PRETRY_BIT*4))))

/******************************************************************************************
************************************8 EEUNLOCK *********************************************
******************************************************************************************/
#define EEPROM_EEUNLOCK            (((EEUNLOCK_TypeDef*)(EEPROM_BASE+EEPROM_EEUNLOCK_OFFSET )))
#define EEPROM_EEUNLOCK_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEUNLOCK_OFFSET)))
#define EEPROM_BITBANDING_EEUNLOCK      (((BITBANDING_EEUNLOCK_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEUNLOCK_OFFSET)*32))))

//--------
#define EEPROM_EEUNLOCK_R_UNLOCK_MASK     (0xFFFFFFFF)
#define EEPROM_EEUNLOCK_R_UNLOCK_BIT      (0)

#define EEPROM_EEUNLOCK_UNLOCK_MASK       (0xFFFFFFFF)
//--------

/******************************************************************************************
************************************ 9 EEPROT *********************************************
******************************************************************************************/
#define EEPROM_EEPROT            (((EEPROT_TypeDef*)(EEPROM_BASE+EEPROM_EEPROT_OFFSET )))
#define EEPROM_EEPROT_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEPROT_OFFSET)))
#define EEPROM_BITBANDING_EEPROT      (((BITBANDING_EEPROT_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEPROT_OFFSET)*32))))

//--------
#define EEPROM_EEPROT_R_PROT_MASK           (0x00000007)
#define EEPROM_EEPROT_R_PROT_BIT            (0)
#define EEPROM_EEPROT_R_PROT_NOPASS_RDWR    (0x00000000)
#define EEPROM_EEPROT_R_PROT_PASS_RDWR      (0x00000001)
#define EEPROM_EEPROT_R_PROT_NOPASS_RD      (0x00000002)

#define EEPROM_EEPROT_PROT_MASK           (0x00000007)
#define EEPROM_EEPROT_PROT_NOPASS_RDWR    (0x00000000)
#define EEPROM_EEPROT_PROT_PASS_RDWR      (0x00000001)
#define EEPROM_EEPROT_PROT_NOPASS_RD      (0x00000002)
//--------

//--------
#define EEPROM_EEPROT_R_ACC_MASK           (0x00000008)
#define EEPROM_EEPROT_R_ACC_BIT            (3)
#define EEPROM_EEPROT_R_ACC_BOTH           (0x00000000)
#define EEPROM_EEPROT_R_ACC_SUPERVISOR     (0x00000008)

#define EEPROM_EEPROT_ACC_MASK           (0x00000001)
#define EEPROM_EEPROT_ACC_BOTH           (0x00000000)
#define EEPROM_EEPROT_ACC_SUPERVISOR     (0x00000001)
//--------

#define EEPROM_BITBANDING_EEPROT_ACC       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEPROT_OFFSET)*32)+(EEPROM_EEPROT_R_ACC_BIT*4))))

/******************************************************************************************
************************************ 10 EEPASS0 *********************************************
******************************************************************************************/
#define EEPROM_EEPASS0            (((EEPASS_TypeDef*)(EEPROM_BASE+EEPROM_EEPASS0_OFFSET )))
#define EEPROM_EEPASS0_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEPASS0_OFFSET)))
#define EEPROM_BITBANDING_EEPASS0      (((BITBANDING_EEPASS_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEPASS0_OFFSET)*32))))

//--------
#define EEPROM_EEPASS0_R_PASS_MASK     (0xFFFFFFFF)
#define EEPROM_EEPASS0_R_PASS_BIT      (0)
#define EEPROM_EEPASS0_R_PASS_NOSET    (0x00000000)
#define EEPROM_EEPASS0_R_PASS_SET      (0x00000001)

#define EEPROM_EEPASS0_PASS_MASK       (0xFFFFFFFF)
#define EEPROM_EEPASS0_PASS_NOSET      (0x00000000)
#define EEPROM_EEPASS0_PASS_SET        (0x00000001)
//--------

/******************************************************************************************
************************************11 EEPASS1 *********************************************
******************************************************************************************/
#define EEPROM_EEPASS1            (((EEPASS_TypeDef*)(EEPROM_BASE+EEPROM_EEPASS1_OFFSET )))
#define EEPROM_EEPASS1_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEPASS1_OFFSET)))
#define EEPROM_BITBANDING_EEPASS1      (((BITBANDING_EEPASS_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEPASS1_OFFSET)*32))))

//--------
#define EEPROM_EEPASS1_R_PASS_MASK     (0xFFFFFFFF)
#define EEPROM_EEPASS1_R_PASS_BIT      (0)
#define EEPROM_EEPASS1_R_PASS_NOSET    (0x00000000)
#define EEPROM_EEPASS1_R_PASS_SET      (0x00000001)

#define EEPROM_EEPASS1_PASS_MASK       (0xFFFFFFFF)
#define EEPROM_EEPASS1_PASS_NOSET      (0x00000000)
#define EEPROM_EEPASS1_PASS_SET        (0x00000001)
//--------

/******************************************************************************************
************************************12 EEPASS2 *********************************************
******************************************************************************************/
#define EEPROM_EEPASS2            (((EEPASS_TypeDef*)(EEPROM_BASE+EEPROM_EEPASS2_OFFSET )))
#define EEPROM_EEPASS2_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEPASS2_OFFSET)))
#define EEPROM_BITBANDING_EEPASS2      (((BITBANDING_EEPASS_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEPASS2_OFFSET)*32))))

//--------
#define EEPROM_EEPASS2_R_PASS_MASK     (0xFFFFFFFF)
#define EEPROM_EEPASS2_R_PASS_BIT      (0)
#define EEPROM_EEPASS2_R_PASS_NOSET    (0x00000000)
#define EEPROM_EEPASS2_R_PASS_SET      (0x00000001)

#define EEPROM_EEPASS2_PASS_MASK       (0xFFFFFFFF)
#define EEPROM_EEPASS2_PASS_NOSET      (0x00000000)
#define EEPROM_EEPASS2_PASS_SET        (0x00000001)
//--------

/******************************************************************************************
************************************13 EEINT *********************************************
******************************************************************************************/
#define EEPROM_EEINT            (((EEINT_TypeDef*)(EEPROM_BASE+EEPROM_EEINT_OFFSET )))
#define EEPROM_EEINT_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEINT_OFFSET)))
#define EEPROM_BITBANDING_EEINT      (((BITBANDING_EEINT_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEINT_OFFSET)*32))))

//--------
#define EEPROM_EEINT_R_INT_MASK       (0x00000001)
#define EEPROM_EEINT_R_INT_BIT        (0)
#define EEPROM_EEINT_R_INT_NOOCCUR    (0x00000000)
#define EEPROM_EEINT_R_INT_OCCUR      (0x00000001)

#define EEPROM_EEINT_INT_MASK         (0x00000001)
#define EEPROM_EEINT_INT_NOOCCUR      (0x00000000)
#define EEPROM_EEINT_INT_OCCUR        (0x00000001)
//--------

#define EEPROM_BITBANDING_EEINT_INT       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEINT_OFFSET)*32)+(EEPROM_EEINT_R_INT_BIT*4))))

/******************************************************************************************
************************************14 EEHIDE *********************************************
******************************************************************************************/
#define EEPROM_EEHIDE            (((EEHIDE_TypeDef*)(EEPROM_BASE+EEPROM_EEHIDE_OFFSET )))
#define EEPROM_EEHIDE_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEHIDE_OFFSET)))
#define EEPROM_BITBANDING_EEHIDE      (((BITBANDING_EEHIDE_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32))))

//--------
#define EEPROM_EEHIDE_R_H1_MASK       (0x00000002)
#define EEPROM_EEHIDE_R_H1_BIT        (1)
#define EEPROM_EEHIDE_R_H1_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H1_HIDE       (0x00000002)

#define EEPROM_EEHIDE_H1_MASK         (0x00000001)
#define EEPROM_EEHIDE_H1_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H1_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H2_MASK       (0x00000004)
#define EEPROM_EEHIDE_R_H2_BIT        (2)
#define EEPROM_EEHIDE_R_H2_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H2_HIDE       (0x00000004)

