InDeviceMex/TM4C123/TM4C123_GPIO_LCD1602/xDriver_MCU/Driver_Header/EEPROM/EEPROM_Register.h
#define EEPROM_EEHIDE_H2_MASK         (0x00000001)
#define EEPROM_EEHIDE_H2_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H2_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H3_MASK       (0x00000008)
#define EEPROM_EEHIDE_R_H3_BIT        (3)
#define EEPROM_EEHIDE_R_H3_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H3_HIDE       (0x00000008)

#define EEPROM_EEHIDE_H3_MASK         (0x00000001)
#define EEPROM_EEHIDE_H3_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H3_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H4_MASK       (0x00000010)
#define EEPROM_EEHIDE_R_H4_BIT        (4)
#define EEPROM_EEHIDE_R_H4_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H4_HIDE       (0x000000010)

#define EEPROM_EEHIDE_H4_MASK         (0x00000001)
#define EEPROM_EEHIDE_H4_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H4_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H5_MASK       (0x00000020)
#define EEPROM_EEHIDE_R_H5_BIT        (5)
#define EEPROM_EEHIDE_R_H5_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H5_HIDE       (0x00000020)

#define EEPROM_EEHIDE_H5_MASK         (0x00000001)
#define EEPROM_EEHIDE_H5_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H5_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H6_MASK       (0x00000040)
#define EEPROM_EEHIDE_R_H6_BIT        (6)
#define EEPROM_EEHIDE_R_H6_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H6_HIDE       (0x00000040)

#define EEPROM_EEHIDE_H6_MASK         (0x00000001)
#define EEPROM_EEHIDE_H6_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H6_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H7_MASK       (0x00000080)
#define EEPROM_EEHIDE_R_H7_BIT        (7)
#define EEPROM_EEHIDE_R_H7_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H7_HIDE       (0x00000080)

#define EEPROM_EEHIDE_H7_MASK         (0x00000001)
#define EEPROM_EEHIDE_H7_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H7_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H8_MASK       (0x00000100)
#define EEPROM_EEHIDE_R_H8_BIT        (8)
#define EEPROM_EEHIDE_R_H8_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H8_HIDE       (0x00000100)

#define EEPROM_EEHIDE_H8_MASK         (0x00000001)
#define EEPROM_EEHIDE_H8_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H8_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H9_MASK       (0x00000200)
#define EEPROM_EEHIDE_R_H9_BIT        (9)
#define EEPROM_EEHIDE_R_H9_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H9_HIDE       (0x00000200)

#define EEPROM_EEHIDE_H9_MASK         (0x00000001)
#define EEPROM_EEHIDE_H9_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H9_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H10_MASK       (0x00000400)
#define EEPROM_EEHIDE_R_H10_BIT        (10)
#define EEPROM_EEHIDE_R_H10_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H10_HIDE       (0x00000400)

#define EEPROM_EEHIDE_H10_MASK         (0x00000001)
#define EEPROM_EEHIDE_H10_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H10_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H11_MASK       (0x00000800)
#define EEPROM_EEHIDE_R_H11_BIT        (11)
#define EEPROM_EEHIDE_R_H11_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H11_HIDE       (0x00000800)

#define EEPROM_EEHIDE_H11_MASK         (0x00000001)
#define EEPROM_EEHIDE_H11_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H11_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H12_MASK       (0x00001000)
#define EEPROM_EEHIDE_R_H12_BIT        (12)
#define EEPROM_EEHIDE_R_H12_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H12_HIDE       (0x00001000)

#define EEPROM_EEHIDE_H12_MASK         (0x00000001)
#define EEPROM_EEHIDE_H12_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H12_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H13_MASK       (0x00002000)
#define EEPROM_EEHIDE_R_H13_BIT        (13)
#define EEPROM_EEHIDE_R_H13_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H13_HIDE       (0x00002000)

#define EEPROM_EEHIDE_H13_MASK         (0x00000001)
#define EEPROM_EEHIDE_H13_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H13_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H14_MASK       (0x00004000)
#define EEPROM_EEHIDE_R_H14_BIT        (14)
#define EEPROM_EEHIDE_R_H14_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H14_HIDE       (0x00004000)

#define EEPROM_EEHIDE_H14_MASK         (0x00000001)
#define EEPROM_EEHIDE_H14_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H14_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H15_MASK       (0x00008000)
#define EEPROM_EEHIDE_R_H15_BIT        (15)
#define EEPROM_EEHIDE_R_H15_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H15_HIDE       (0x00008000)

#define EEPROM_EEHIDE_H15_MASK         (0x00000001)
#define EEPROM_EEHIDE_H15_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H15_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H16_MASK       (0x00010000)
#define EEPROM_EEHIDE_R_H16_BIT        (16)
#define EEPROM_EEHIDE_R_H16_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H16_HIDE       (0x00010000)

#define EEPROM_EEHIDE_H16_MASK         (0x00000001)
#define EEPROM_EEHIDE_H16_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H16_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H17_MASK       (0x00020000)
#define EEPROM_EEHIDE_R_H17_BIT        (17)
#define EEPROM_EEHIDE_R_H17_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H17_HIDE       (0x00020000)

#define EEPROM_EEHIDE_H17_MASK         (0x00000001)
#define EEPROM_EEHIDE_H17_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H17_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H18_MASK       (0x00040000)
#define EEPROM_EEHIDE_R_H18_BIT        (18)
#define EEPROM_EEHIDE_R_H18_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H18_HIDE       (0x00040000)

#define EEPROM_EEHIDE_H18_MASK         (0x00000001)
#define EEPROM_EEHIDE_H18_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H18_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H19_MASK       (0x00080000)
#define EEPROM_EEHIDE_R_H19_BIT        (19)
#define EEPROM_EEHIDE_R_H19_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H19_HIDE       (0x00080000)

#define EEPROM_EEHIDE_H19_MASK         (0x00000001)
#define EEPROM_EEHIDE_H19_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H19_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H20_MASK       (0x00100000)
#define EEPROM_EEHIDE_R_H20_BIT        (20)
#define EEPROM_EEHIDE_R_H20_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H20_HIDE       (0x00100000)

#define EEPROM_EEHIDE_H20_MASK         (0x00000001)
#define EEPROM_EEHIDE_H20_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H20_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H21_MASK       (0x00200000)
#define EEPROM_EEHIDE_R_H21_BIT        (21)
#define EEPROM_EEHIDE_R_H21_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H21_HIDE       (0x00200000)

#define EEPROM_EEHIDE_H21_MASK         (0x00000001)
#define EEPROM_EEHIDE_H21_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H21_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H22_MASK       (0x00400000)
#define EEPROM_EEHIDE_R_H22_BIT        (22)
#define EEPROM_EEHIDE_R_H22_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H22_HIDE       (0x00400000)

#define EEPROM_EEHIDE_H22_MASK         (0x00000001)
#define EEPROM_EEHIDE_H22_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H22_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H23_MASK       (0x00800000)
#define EEPROM_EEHIDE_R_H23_BIT        (23)
#define EEPROM_EEHIDE_R_H23_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H23_HIDE       (0x00800000)

