InDeviceMex/TM4C123/TM4C123_GPIO_LCD1602/xDriver_MCU/Driver_Header/EEPROM/EEPROM_Register.h
#define EEPROM_EEHIDE_H23_MASK         (0x00000001)
#define EEPROM_EEHIDE_H23_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H23_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H24_MASK       (0x01000000)
#define EEPROM_EEHIDE_R_H24_BIT        (24)
#define EEPROM_EEHIDE_R_H24_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H24_HIDE       (0x01000000)

#define EEPROM_EEHIDE_H24_MASK         (0x00000001)
#define EEPROM_EEHIDE_H24_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H24_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H25_MASK       (0x02000000)
#define EEPROM_EEHIDE_R_H25_BIT        (25)
#define EEPROM_EEHIDE_R_H25_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H25_HIDE       (0x02000000)

#define EEPROM_EEHIDE_H25_MASK         (0x00000001)
#define EEPROM_EEHIDE_H25_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H25_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H26_MASK       (0x04000000)
#define EEPROM_EEHIDE_R_H26_BIT        (26)
#define EEPROM_EEHIDE_R_H26_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H26_HIDE       (0x04000000)

#define EEPROM_EEHIDE_H26_MASK         (0x00000001)
#define EEPROM_EEHIDE_H26_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H26_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H27_MASK       (0x08000000)
#define EEPROM_EEHIDE_R_H27_BIT        (27)
#define EEPROM_EEHIDE_R_H27_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H27_HIDE       (0x08000000)

#define EEPROM_EEHIDE_H27_MASK         (0x00000001)
#define EEPROM_EEHIDE_H27_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H27_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H28_MASK       (0x10000000)
#define EEPROM_EEHIDE_R_H28_BIT        (28)
#define EEPROM_EEHIDE_R_H28_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H28_HIDE       (0x10000000)

#define EEPROM_EEHIDE_H28_MASK         (0x00000001)
#define EEPROM_EEHIDE_H28_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H28_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H29_MASK       (0x20000000)
#define EEPROM_EEHIDE_R_H29_BIT        (29)
#define EEPROM_EEHIDE_R_H29_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H29_HIDE       (0x20000000)

#define EEPROM_EEHIDE_H29_MASK         (0x00000001)
#define EEPROM_EEHIDE_H29_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H29_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H30_MASK       (0x40000000)
#define EEPROM_EEHIDE_R_H30_BIT        (30)
#define EEPROM_EEHIDE_R_H30_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H30_HIDE       (0x40000000)

#define EEPROM_EEHIDE_H30_MASK         (0x00000001)
#define EEPROM_EEHIDE_H30_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H30_HIDE         (0x00000001)
//--------

//--------
#define EEPROM_EEHIDE_R_H31_MASK       (0x80000000)
#define EEPROM_EEHIDE_R_H31_BIT        (31)
#define EEPROM_EEHIDE_R_H31_NOHIDE     (0x00000000)
#define EEPROM_EEHIDE_R_H31_HIDE       (0x80000000)

#define EEPROM_EEHIDE_H31_MASK         (0x00000001)
#define EEPROM_EEHIDE_H31_NOHIDE       (0x00000000)
#define EEPROM_EEHIDE_H31_HIDE         (0x00000001)
//--------


#define EEPROM_BITBANDING_EEHIDE_H1       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H1_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H2       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H2_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H3       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H3_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H4       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H4_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H5       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H5_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H6       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H6_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H7       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H7_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H8       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H8_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H9       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H9_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H10      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H10_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H11      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H11_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H12      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H12_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H13      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H13_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H14      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H14_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H15      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H15_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H16      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H16_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H17      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H17_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H18      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H18_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H19      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H19_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H20      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H20_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H21      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H21_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H22      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H22_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H23      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H23_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H24      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H24_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H25      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H25_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H26      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H26_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H27      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H27_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H28      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H28_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H29      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H29_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H30      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H30_BIT*4))))
#define EEPROM_BITBANDING_EEHIDE_H31      (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEHIDE_OFFSET)*32)+(EEPROM_EEHIDE_R_H31_BIT*4))))

/******************************************************************************************
************************************15 EEDBGME *********************************************
******************************************************************************************/
#define EEPROM_EEDBGME            (((EEDBGME_TypeDef*)(EEPROM_BASE+EEPROM_EEDBGME_OFFSET )))
#define EEPROM_EEDBGME_R          (*((volatile uint32_t *)(EEPROM_BASE+EEPROM_EEDBGME_OFFSET)))
#define EEPROM_BITBANDING_EEDBGME (((BITBANDING_EEDBGME_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEDBGME_OFFSET)*32))))

//--------
#define EEPROM_EEDBGME_R_ME_MASK       (0x00000001)
#define EEPROM_EEDBGME_R_ME_BIT        (0)
#define EEPROM_EEDBGME_R_ME_NA         (0x00000000)
#define EEPROM_EEDBGME_R_ME_ERASE      (0x00000001)

#define EEPROM_EEDBGME_ME_MASK         (0x00000001)
#define EEPROM_EEDBGME_ME_NA           (0x00000000)
#define EEPROM_EEDBGME_ME_ERASE        (0x00000001)
//--------

//--------
#define EEPROM_EEDBGME_R_KEY_MASK       (0xFFFF0000)
#define EEPROM_EEDBGME_R_KEY_BIT        (0)
#define EEPROM_EEDBGME_R_KEY_ERASE      (0xE37B0000)

#define EEPROM_EEDBGME_KEY_MASK         (0x0000FFFF)
#define EEPROM_EEDBGME_KEY_ERASE        (0x0000E37B)
//--------

#define EEPROM_BITBANDING_EEDBGME_ME       (*((volatile uint32_t *)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEDBGME_OFFSET)*32)+(EEPROM_EEDBGME_R_ME_BIT*4))))

/******************************************************************************************
************************************16 EEPROMPP *********************************************
******************************************************************************************/
#define EEPROM_EEPROMPP            (((EEPROMPP_TypeDef*)(EEPROM_BASE+EEPROM_EEPROMPP_OFFSET )))
#define EEPROM_EEPROMPP_R          (*((volatile const uint32_t *)(EEPROM_BASE+EEPROM_EEPROMPP_OFFSET)))
#define EEPROM_BITBANDING_EEPROMPP      (((BITBANDING_EEPROMPP_TypeDef*)(EEPROM_BITBANDING_BASE+((EEPROM_OFFSET+EEPROM_EEPROMPP_OFFSET)*32))))

//--------
#define EEPROM_EEPROMPP_R_SIZE_MASK       (0x0000001F)
#define EEPROM_EEPROMPP_R_SIZE_BIT        (0)
#define EEPROM_EEPROMPP_R_SIZE_2KB        (0x0000001F)

#define EEPROM_EEPROMPP_SIZE_MASK         (0x0000001F)
#define EEPROM_EEPROMPP_SIZE_2KB          (0x0000001F)
//--------


#endif /* XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_REGISTER_H_ */
